clear;
clc;
%经过统计计算，得到已知类别的输入向量：
p=[0 1 0 5 1 3 2 2 2 1 19 18 23 17 43 12 2 17 19 23;
    1 2 0 4 1 1 1 4 0 1 13 15 13 11 9 9 2 14 12 7;
    5 5 8 0 10 9 5 7 11 9 0 0 1 0 0 0 3 1 0 0;
    7 10 16 2 11 9 6 5 8 6 0 0 0 1 0 0 3 2 0 0;
    10 11 15 2 11 12 12 9 5 6 2 1 1 1 0 1 1 0 1 1];
%待判类别的输入向量：
P = [9 2 3 13 3 15 3 10 3 2 6 5 9 2 2 2 2 16 2 18;
    7 4 4 8 5 9 6 12 3 3 12 4 7 3 2 4 4 10 2 10;
    0 0 4 1 5 0 2 1 7 0 2 2 0 4 2 1 3 1 2 1;
    0 2 8 0 1 1 5 0 7 0 1 3 0 3 3 1 1 1 0 2;
    2 3 9 1 2 1 8 1 5 0 2 1 1 5 4 1 3 1 1 2];

t=[1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0];

%单因素方差分析
%X=[0 1 0 5 1 3 2 2 2 1;19 18 23 17 43 12 2 17 19 23];
%p=anova1(X');

net=newff([0 20;0 16;0 12;0 12;0 13],[3 1],{'logsig' 'purelin'},'traingdx');
net.trainparam.show=100;
        %两次显示之间的训练步数
net.trainparam.lr=0.5;   %学习率
net.trainparam.mc=0.8;   %惯性常数
net.trainparam.epochos=20000;
net.trainparam.goal=0.01;  %训练目标
[net,tr]=train(net,p,t);
Y=sim(net,p);
a=sim(net,P);
disp(a);